УправлениеПаркомАттракционов/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ИдентиФикаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Enums/РолиПользователей/РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиПользователей</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Кассир</name>
  </enumValues>
  <enumValues>
    <name>ОператорАттракциона</name>
  </enumValues>
</mdclass:Enum>

УправлениеПаркомАттракционов/src/Catalogs/Пользователи/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентиФикаторПользователяИБ);
	
	Если ПользовательИБ = Неопределено Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		
	КонецЕсли;

	ПользовательИБ.АутентификацияСтандартная = ДоступРазрешен;
	ПользовательИБ.ПолноеИмя = ТекущийОбъект.Наименование;
	ПользовательИБ.Имя = Логин;
	
	Если ПарольУстановлен Тогда
		
		ПользовательИБ.Пароль = Пароль;

	КонецЕсли;
	
	ПользовательИБ.Роли.Очистить();
	
	Если РольПользователя = Перечисления.РолиПользователей.Кассир Тогда

		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Кассир);
				
	ИначеЕсли РольПользователя = Перечисления.РолиПользователей.ОператорАттракциона Тогда

		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ОператорАттракциона);
				
	ИначеЕсли РольПользователя = Перечисления.РолиПользователей.Администратор Тогда

		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);

	КонецЕсли;
	
	ПользовательИБ.Записать();
	
	ТекущийОбъект.ИдентиФикаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентиФикаторПользователяИБ);

	Если ПользовательИБ <> Неопределено Тогда
	
		Объект.Наименование = ПользовательИБ.ПолноеИмя;
		Логин = ПользовательИБ.Имя;
		ДоступРазрешен = ПользовательИБ.АутентификацияСтандартная;
		
		Если ЗначениеЗаполнено(ПользовательИБ.СохраняемоеЗначениеПароля) Тогда
			
			ПарольУстановлен = Истина;
			Пароль = "№;%:??**пар";
			
		КонецЕсли;
		
		ЭтоАдминистратор = Ложь;
		ЭтоКассир = Ложь;
		ЭтоОператор = Ложь;
		
		Для Каждого Роль Из ПользовательИБ.Роли Цикл
			
			Если Роль = Метаданные.Роли.ПолныеПрава Тогда
				
				ЭтоАдминистратор = Истина;
				
			ИначеЕсли Роль = Метаданные.Роли.Кассир Тогда
				
				ЭтоКассир = Истина;
				
			ИначеЕсли Роль = Метаданные.Роли.ОператорАттракциона Тогда
				
				ЭтоОператор = Истина;
				
			КонецЕсли;
			
		КонецЦикла; 
			
		Если ЭтоАдминистратор Тогда
			
			РольПользователя = Перечисления.РолиПользователей.Администратор;
			
		ИначеЕсли ЭтоКассир Тогда
			
			РольПользователя = Перечисления.РолиПользователей.Кассир;
			
		ИначеЕсли ЭтоОператор Тогда
			
			РольПользователя = Перечисления.РолиПользователей.ОператорАттракциона;
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПарольПриИзменении(Элемент)

	ПарольУстановлен = Истина;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
